# Data Manipulation Language (DML) and Subquerying

## **Introduction**

Data Manipulation Language (DML) is a subset of SQL used for adding, deleting, and modifying data in a database. 

**Data Manipulation Language Keywords:**

- INSERT- Adds data into an existing object
- UPDATE- Modifies existing data in an object
- DELETE- Removes existing data from an object

It is crucial that you have an understanding of DML to properly administrate and interact with a database. Up to this point we have focused on data retrevial techniques like forming SELECT queries using JOINs, Aggregation. We will expand on your retrieval skills by learning to construct subqueries.

## **Inserting Data**

Inserting data is a very common DML process. All of the data we are have been working with this semester has been inserted using INSERT statements. INSERT statements have a very straightforward syntax. The basic structure of an INSERT STATEMENT is defined below:

1. Begin with INSERT INTO
2. Type the table name
3. Inside of parenthesis, list the column names you would like to insert into.
4. If you are inserting into all columns, you can actually skip step 3. For tables that have an autoincrementing field, you must complete step 3.
5. Use the VALUES keyword to let the database engine know that you are providing data
6. In parethesis, list out the data you would like to insert. You can insert multiple rows by placing a comma after your closing parenthesis and beginning a new set

Below is an example of an INSERT query that is adding data to the ap\_airline table. We start by specifiying which columns we are adding data to, then we list the values in parenthesis.

Please run the below cells in order:

1. Cell with the SELECT query to view all records in the ap\_airline table
2. Cell with INSERT INTO query to add a record
3. Second cell with SELECT query to see the new data in your dataset.

In [ ]:
--View all records for ap_airline
SELECT *
FROM ap_airline

In [ ]:
--Insert one new record into ap_airline
INSERT INTO ap_airline (airline_id, airline_name)
VALUES (6,'Sprint Air')

In [ ]:
--View all records (including new record) for ap_airline
SELECT *
FROM ap_airline

If we are adding data to every column in a table, then we can use _simple_ INSERT statements like below:

In [ ]:
--Insert data into all columns of ap_airline
INSERT INTO ap_airline
VALUES (7, 'Ultra Air')

In [ ]:
--View new recod in ap_airline
SELECT *
FROM ap_airline

Using this syntax makes it easy to add several rows to a table at once. We do this by separating the data for each row with parenthesis. In the below example we add 3 new rows to the ap\_flight table.

In [ ]:
--Add three rows to ap_flight
INSERT INTO ap_flight
VALUES (6,6,'SA987','St Louis'),
(7,7,'UA293','Kansas City'),
(8,7,'UA829','Pheonix')

In [ ]:
--View new records in ap_flight
SELECT *
FROM ap_flight

### ✏️ **Practice**

Try adding some data to the ap\_customer table. I've started the query for you. Please complete it to add the following information (4 rows):
|customer_id|first_name|last_name|date_of_birth|
|---|---|---|---|
|6|Alice|Dawn|1997-07-21|
|7|Jacob|Swift|1999-02-18|
|8|Bob|Horton|1987-04-29|
|9|Kate|Barnett|1997-06-22|

In [ ]:
INSERT INTO ap_customer

## **Updating Data**

We can update data in SQL using the UPDATE keyword. Updates are simple to write, but very easy to mess up. You have to make sure that you are specific about what data you are wanting to update. If you do not properly select which data you are updating, you could end up changing all of the data in the table. Below is an example of an update statement for the ap\_flight table where we change the destination of flight GW789 to Tokyo.

In [ ]:
UPDATE ap_flight SET destination = 'Tokyo' --The SET keyword is used to identify which column needs updated.
WHERE flight_number = 'GW789' --The WHERE clause here is to ensure we only update a specific row

You can also update multiple fields at once in the same update query. You only need to seperate each column/value combination with commas in the following pattern:

UPDATE TableName

SET Column1 = Value1,

Column2 = Value2,

Column3 = Value3

WHERE SomeColumn = SomeCriteria

In the below example we are updating the first name, last name, and birthdate of one of the customers we added in a prior query.

In [ ]:
UPDATE ap_customer SET first_name = 'Avery',
last_name = 'Grambs',
date_of_birth = '2003-10-18'
WHERE customer_id = 8

In [ ]:
--View newly updated record
SELECT *
FROM ap_customer

UPDATE queries are powerful tools for making changes to our data, but can be catastrophic when used incorrectly. The below cell has an executable (but inmproper) UPDATE statement.

  

The intention of the below cell is to update the destination for a single flight, but because the author did not use a WHERE clause, all rows are updated. Run the cell and obeserve the result.

In [ ]:
--Update destination for flight UA293 (Incorrect)
UPDATE ap_flight SET destination = 'Paris'

In [ ]:
SELECT *
FROM ap_flight

We can see that all rows were updated with the new destination, instead of the intended row. We hav eno protections in place to correct errors like these when they occur, so for now you will have to be careful when authoring UPDATE scripts.

Run the below cell to fix the errors that the last script created.

In [ ]:
--Repair data in flight table
UPDATE ap_flight SET destination = 'New York' WHERE flight_id = 1
UPDATE ap_flight SET destination = 'Los Angeles' WHERE flight_id = 2
UPDATE ap_flight SET destination = 'Chicago' WHERE flight_id = 3
UPDATE ap_flight SET destination = 'Miami' WHERE flight_id = 4
UPDATE ap_flight SET destination = 'Tokyo' WHERE flight_id = 5
UPDATE ap_flight SET destination = 'St Louis' WHERE flight_id = 6
UPDATE ap_flight SET destination = 'Kansas City' WHERE flight_id = 7
UPDATE ap_flight SET destination = 'Pheonix' WHERE flight_id = 8

In [ ]:
--Verify that data is resotred
SELECT *
FROM ap_flight

### ✏️ **Practice**

Construct an UPDATE script to correct an error in the passport number for customer 4. They system shows _P456789_ but their passport number is acutally _P456889._ Please ensure that you are only updating the data for the specified row.

In [ ]:
--Your code here

In [ ]:
--Check your work
SELECT *
FROM ap_passport

## **Deleting Data**

Deleting is one of the most simple DML tools to script, but similar to updating, it is easy to make mistakes and mess up your data. The most important thing to keep in mind when deleting is that you must have a where condition to specify which rows to delete, or you may delete all of the data in the table. Below is a deletion example where we are deleting a boarding pass from the ap\_boarding\_pass table.

In [ ]:
--Delete Boarding Pass BP567890123456789 from table
DELETE
FROM ap_boarding_pass
WHERE boarding_pass_number = 'BP567890123456789'

In [ ]:
--Verify that this boarding pass number is not in the dataset anymore
SELECT *
FROM ap_boarding_pass

Just like when we are updating data, we _must_ use a WHERE clause to specify which data we want to delete, or we will delete all of the data from the table.

  

Although we haven't discussed constraints, we cannot properly address DELETE queries without a brief introduction. When we assign a value as a FK in a table, this means that value must exist in the table that it is related to. For example, we cannot have customer\_id 9 in our boarding pass table, because there is no related record in the customer table.

  

This is important when discussing DELETE queries because these constraints will prevent us from deleting data that will cause there to be FKs without corresponding primary keys.

  

The below query _attempts_ to delete a customer, but the system will prevent this operation because that customer has a record in the boarding\_pass table. Try it now and review the error we recieve.

In [ ]:
DELETE
FROM ap_customer
WHERE customer_id = 1

There are three parts to this error message:

1. Location of the error (line 1)
2. Error Description (The DELETE statement.....)
3. Error Specifics (FK\_\_ap\_boardi\_\_custo\_\_45BE5Ba9......)
4. The error specifics lists the name of the constraint that has been violated and provides the table and column that the constraint is associated with.

This means that to delete a record that has an _active_ FK in other tables, you first must delete the related records, and then delete the _source_ record.

  

customer\_id is a FK in two tables: boarding\_pass and passport. Before we can delete a customer we must delete their corresponding records in each of these tables.

In [ ]:
--Delete Customer from passport
DELETE
FROM ap_passport
WHERE customer_id = 1

--Delete customer from boarding_pass
DELETE
FROM ap_boarding_pass
WHERE customer_id = 1

--Delete customer from customer
DELETE
FROM ap_customer
WHERE customer_id = 1

In [ ]:
--Verify Deletion in all three tables
SELECT *
FROM ap_customer 

SELECT *
FROM ap_passport

SELECT *
FROM ap_boarding_pass

## **Subqueries**

Subqueries allow us to nest an existing query within a new query. The purpose of a subquery is to process data, that has already been processed at least once. The three main reasons that we would do this are:

- Implment an aggregated value into a WHERE clause
- Use the return of a query as a data source in the FROM clause
- Check to see if a value is present in the return of another query using the IN operator

For the rest of this notebook, we will be shifting to a new database called Storage Unit. The Storage Unit database keeps track of information related to the rental of storage units. Please review the ERD in Github for familiarity.

We will start with a query that implements an aggregate value into the WHERE clause. When using this technique, you must make sure that your _inner_ query only returns one record. For this query we will be seeing which customers are recieving the maximum discount. We will solve this problem in two phases:

- Phase 1: Write a query to get the maximum discount

In [ ]:
--Get maximum discount amount from rental table. (Inner Query)
SELECT MAX(r.discount_amount)
FROM su_rental as r

- Phase 2: Write a query that pulls the customer name for each rental that is recieving the max discount

In [ ]:
--Get customer info for rentals recieving max discount (Outer query)
--Select fields to return
SELECT c.first_name, c.last_name
FROM su_customer as c
JOIN su_rental as r ON c.customer_id = r.customer_id
--Add subquery from phase 1 to WHERE clause
WHERE r.discount_amount = (
    SELECT MAX(r.discount_amount)
    FROM su_rental as r
)

We can also use subqueries in our FROM clauses. There may be times that we need to use another query's result as if it is a table. We refer to these as derived tables. In this instance we can have as many columns and records in the inner query as we want. For the below example, we will find the average discount given for each type of unit. We will complete this in two phases:

- Phase 1: Write a query to select the average discount for each type\_id

In [ ]:
SELECT type_id, AVG(discount_amount) as max_discount
FROM su_rental AS r
JOIN su_unit u ON r.unit_id = u.unit_id
GROUP BY type_id

- Phase 2:  Write a query to return all the information from the type table for each type in the return of the prior query. Do this by joining an existing table to the subquery

In [ ]:
--Choose columns to return
SELECT t.type_id, t.length, t.width, t.height, d.avg_discount
FROM su_type AS t
--JOIN the subquery on a commmon field as if it is a table
JOIN (
    SELECT type_id, AVG(discount_amount) as avg_discount
    FROM su_rental AS r
    JOIN su_unit u ON r.unit_id = u.unit_id
    GROUP BY type_id
) AS d ON t.type_id = d.type_id;

To check to see if a value is present in the return of another query, we use the IN operator in our WHERE clause. Let's say that we want to return how many units at each facility have been rented out more than once. We will solve this problem in two phases:

- Phase 1: Write a query to determine which units have been rented out multiple times

In [ ]:
--Get the unit_ids for units that have been rented multiple times
SELECT r.unit_id
FROM su_rental as r
GROUP BY r.unit_id
HAVING COUNT(*) > 1

- Phase 2: Write a query that counts how many units have been rented out multiple times, by facillity

In [ ]:
--select the city and count the units
SELECT f.city, COUNT(u.unit_id) AS unit_count 
FROM su_facility as f
JOIN su_unit as u ON f.facility_id = u.facility_id
--Use the IN operator to only return records from su_unit where the unit_id is in the return of the query we created in phase 1
WHERE u.unit_id IN (
    SELECT r.unit_id
    FROM su_rental as r
    GROUP BY r.unit_id
    HAVING COUNT(*) > 1
)
--Group by city since we are doing aggregation
GROUP BY f.city

## **Exercises**

‼️ If you have not already, I would strongly recommend having access to the ERD Linked in github for the Exercises.

1\. In the below code cell, construct a query to insert the following data to the rental table:
|rental_id|unit_id|customer_id|start_date|end_date|payment_option|discount_amount|
|---|---|---|---|---|---|---|
|151|30|31|2024-02-01|2024-03-01|M|0.00|
|152|31|32|2024-02-01|2024-03-01|M|20.00|
|153|31|32|2024-02-01|2024-03-01|M|5.00|

In [ ]:
--Your code here
INSERT INTO rental (rental_id, unit_id, customer_id, start_date, end_date, payment_option, discount_amount)
VALUES 
(151, 30, 31, '2024-02-01', '2024-03-01', 'M', 0.00),
(152, 31, 32, '2024-02-01', '2024-03-01', 'M', 20.00),
(153, 31, 32, '2024-02-01', '2024-03-01', 'M', 5.00);

2\. In the below code cell, construct a query to update the status of unit number A70 to available.

In [ ]:
--Your code here
UPDATE units
SET status = 'available'
WHERE unit_number = 'A70';

3\. In the below code cell, construct a query to return the invoice id for the invoice dated 2025-01-15.

In [ ]:
--Your code here
SELECT invoice_id
FROM invoices
WHERE invoice_date = '2025-01-15';

4\. In the below code cell, construct up a query to delete any payment records associated with an invoice date of 2025-01-15.

You must use the above query as a subquery to specify which data should be deleted. Use the IN operator in your WHERE clause to set this criteria.

In [ ]:
--Your code here
DELETE FROM payments
WHERE invoice_id IN (
    SELECT invoice_id
    FROM invoices
    WHERE invoice_date = '2025-01-15'
);

## **Scenario**

There has been a system error in the Storage Unit database. Customers who signed up for a yearly rental are still showing an end date that is one month after the start date instead of the full year.

Construct an update query to update the end date of all rentals with a yearly payment option to be 1 year after the current start date.

Do not hard-code dates into your query, instead, research how to use the DATEADD() function in SQL server.

In [ ]:
--Your code here
UPDATE rental
SET end_date = DATEADD(year, 1, start_date)
WHERE payment_option = 'Y';